src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Documents/АрхитектурноеРешение/АрхитектурноеРешение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АрхитектурноеРешение</name>
  <registerRecords>InformationRegister.СвязиБизнесДоменов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАрхитектурногоРешения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененияДоменов</name>
    <attributes>
      <name>БизнесДомен</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиДоменов</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>Приемник</name>
      <type>
        <types>CatalogRef.БизнесДомены</types>
      </type>
    </attributes>
    <attributes>
      <name>Действия</name>
      <type>
        <types>EnumRef.ДействияПоАрхитектуре</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПотока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Интеграции</name>
    <attributes>
      <name>Интеграция</name>
      <type>
        <types>CatalogRef.Интеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Действия</name>
      <type>
        <types>EnumRef.ДействияПоАрхитектуре</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/InformationRegisters/СвязиБизнесДоменов/СвязиБизнесДоменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиБизнесДоменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действия</name>
    <type>
      <types>EnumRef.ДействияПоАрхитектуре</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.БизнесДомены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.БизнесДомены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/СтатусАрхитектурногоРешения/СтатусАрхитектурногоРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусАрхитектурногоРешения</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>Предложен</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Замещен</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Documents/АрхитектурноеРешение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СвязиБизнесДоменов.Записывать = Истина;
		
	Для Каждого ТекСтрока Из СвязиДоменов Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Действия) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Действия = Перечисления.СтатусАрхитектурногоРешения.Проект
			Или ТекСтрока.Действия = Перечисления.СтатусАрхитектурногоРешения.Отклонен Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.СвязиБизнесДоменов.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Источник = ТекСтрока.Источник;
		Движение.Приемник = ТекСтрока.Приемник;
		
		Движение.Действия = ТекСтрока.Действия;
		Движение.ОписаниеПотока = ТекСтрока.ОписаниеПотока;
		Движение.ОписаниеИзменения = ТекСтрока.ОписаниеИзменения;
		Движение.Приоритет = ?(ТекСтрока.Приоритет = 0, 99, ТекСтрока.Приоритет);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
